<?php
/**
 * Error_list 错误信息及代码
 *
 * @author      yanghaibo
 * @date        2014-12-23
 * @category    Error_list
 *
 * @version     $Id$
 */
class CI_Error_list
{
    public $error_list = array(
        /***** 系统保留错误 开始 *****/
        /***** 10000-19999都为正确的状态 *****/
        '10000' => 'ok', // 接口请求成功

        // 其它系统错误
        '99998' => '内部错误', // PHP内部错误:语法、数据库等
        '99999' => '其它错误',
        /***** 系统保留错误 结束 *****/

        /***** 系统级通用错误 开始 *****/
        /*****  (20001 - 29999)    *****/
        '20001' => '请求参数为空',
        '20002' => '请求参数不是有效的JSON',
        '20003' => '请求参数{0}为空',
        '20004' => '接口名称不能为空',
        '20005' => '时间不能为空',
        '20006' => '响应格式非法',
        '20007' => '版本号非法',
        '20008' => '字符编码不正确',
        '20009' => '加密方式错误',
        '20010' => 'app_key不能为空',
        '20011' => 'app_session不能为空',
        '20012' => '签名不能为空',
        '20013' => '签名错误',
        '20014' => 'params不是有效的JSON',
        '20015' => '接口名称非法',
        '20016' => '接口不存在',
        '20017' => 'app_key错误',
        '20018' => 'app_key已禁用',
        '20019' => 'app_session错误',
        '20020' => 'app_session已过期',
        '20021' => '请求失效',
        '20022' => 'page_size错误',
        '20023' => 'page_no错误',
        '20024' => 'page_no最多为{0}条',
        '20025' => '无权限',
        '20026' => 'session 过期',
        '20027' => 'session 无效',
        '20028' => '身份组对应的参数设置错误',
        '20029' => '请使用POST请求',
        '20030' => '无效用户',
        '20031' => '重复的请求', // 重复的并发请求
        '20032' => '请先登录',
        '20033' => '不明确具体项目',
        '20034' => '配置名称为空',
        '20035' => 'push_token 为空',
        '20036' => '不是指定的数据类型',
        '20037' => '名称为{0}的配置不存在或为空',
        '20038' => '目前版本过低请升级为最新版本',

        // Requester错误
        '29001' => '服务名称没有提供，并且不是字符串',
        '29002' => '服务参数没有提供，并且不是数组',
        '29003' => '指定必填写请求参数为空',
        '29004' => '没有找到文件（服务名或类名错误）',
        '29005' => '没有找到指定的方法！',
        /***** 系统级通用错误 结束 *****/

        /***** 以下为业务逻辑错误  *****/

        /***** 业务级通用错误 开始 *****/
        /*****（30001 - 39999）    *****/
        '30001' => '没有需要修改的数据',
        '30002' => '没有指定需要修改的条件',
        '30003' => '请指定操作的唯一条件',
        '30004' => '没有需要添加的数据',
        /***** 业务级通用错误 结束 *****/

        /***** 业务级一般错误 开始  *****/

        /***** 业务级一般错误 结束  *****/
    );
}
